<details><summary>Show Plan</summary>

```terraform
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-prod]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-prod]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-prod]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-prod]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-prod]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-prod]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459900000002]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459800000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907497100000004]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907477100000003]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-prod]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-prod]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=r242yimvi1]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=a0zpgqqrs2]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=5fakqp]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=kttj2y]
module.api_app.aws_api_gateway_method.opt_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-OPTIONS]
module.api_app.aws_api_gateway_method.get_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_integration.get_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_method_response.opt_daily_coffee: Refreshing state... [id=agmr-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_api_gateway_integration.opt_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-OPTIONS]
module.api_app.aws_api_gateway_integration_response.opt_daily_coffee: Refreshing state... [id=agir-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=x4yv36]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-a0zpgqqrs2-prod]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=n2tyx8]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=r242yimvi1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda_functions.aws_lambda_function.daily_coffee will be updated in-place
  ~ resource "aws_lambda_function" "daily_coffee" {
        id                             = "daily_coffee-prod"
      ~ last_modified                  = "2024-01-28T22:13:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "+VKw7fqAC3bKzXZgqZwyPH3EHK9twSZ14VxC3Ab1cWU=" -> "tmJHTThzzoS1I8SVJ3yr0AxyiK9gBLmkIwre3IVnx0k="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_functions.aws_lambda_function.populate_coffee_pool will be updated in-place
  ~ resource "aws_lambda_function" "populate_coffee_pool" {
        id                             = "populate_coffee_pool-prod"
      ~ last_modified                  = "2024-01-28T22:13:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "617MpzawhHZk8fATARWOHFxJaU5zl+ADle0dQ+eyP6k=" -> "nCNL6cIXdQcSw+NRA7H1Gz864jEvtshmTk8TPZf0A4M="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.s3_hosting.aws_cloudfront_distribution.this will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = (known after apply)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.s3_hosting.aws_cloudfront_origin_access_control.this will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + description                       = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = (known after apply)
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.s3_hosting.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_hosting.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_hosting.random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`